app/models/gossip.rb

	def self.showall
		gossip_array = Gossip.all
---
SELECT "gossips".* FROM "gossips"