app/models/user.rb

	def self.showall
		user_array = User.all
---
SELECT "users".* FROM "users"